#include<stdio.h>
//#include<string.h>
//int main()
//{
//	char arr[1000] = { 0 };
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		arr[i] = -1 - i;//-1、-2、-3......-128、127...3、2、1、0、-1...
//	}//char 是有符号数 范围是0到255
//	printf("%d\n", strlen(arr));//strlen函数遇到\0就会停下
//	return 0;
//}//答案是255 128+127


//打印杨辉三角
//int main()
//{
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 10; i++)
//	{
//		//遍历一行
//		for (j = 0; j < 10; j++)
//		{
//			//遍历一列
//			if (j == 0)//第一列
//			{
//				arr[i][j] = 1;//把第一列全部赋值成1
//			}
//			if (arr[i] == arr[j])//对角线
//			{
//				arr[i][j] = 1;//把对角线全部赋值成1 
//			}
//			if (i >= 2 && j >= 1)
//			{
//				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//			}//重要一步，计算三角里面的数字
//		}
//	}
//	for (i = 0; i < 10; i++)//打印出来
//	{
//		for (j = 0; j <=i; j++)//去掉上三角 如果不去掉j应该小于10
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	
//
//	return 0;
//}

//猜凶手：日本某地发生了一起谋杀案，警察通过排查确定杀人凶手必为四个嫌疑犯中的一个
//A:不是我
//B：是C
//C：是D
//D：C在胡说
//写一程序，确定杀人凶手是谁。3人说了真话，1人说了假话
//int main()
//{
//	int killer = 0;
//	for (killer='a';killer<='d';killer++)//循环分别假设ABCD是凶手
//	{
//		if ((killer = !'a') + (killer == 'c') + (killer == 'd') + (killer != 'd')==3)
//		{
//			//假设A是凶手，那么四个条件就有三件为假，为假就是1，所以等于3
//			printf("killer=%c\n", killer);
//		}
//	}
//	return 0;
//}

//五位运动员参加了10米台跳水比赛
//A:B是第一名，我是第三名
//B：B是第二名，E是第四名
//C：C是第一名，D是第二名
//D：C是第五名，D是第三名
//E：E是第四名，A是第一名
//比赛过后，选手们都说对了一半。写一段程序，求出大家的名次
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1; a <= 5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if (((b == 1) + (a == 3) == 1) &&
//							((b == 2) + (e == 4) == 1) &&
//							((c == 1) + (d == 2) == 1) &&
//							((c == 4) + (d == 3) == 1) &&
//							((e == 4) + (a == 1) == 1))
//						{
//							if (a * b * c * d * e == 120)
//								printf("a=%d,b=%d,c=%d,d=%d,e=%d", a, b, c, d, e);
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}

