#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//-10
//10000000 00000000 00000000 00001010
//11111111 11111111 11111111 11110101
//11111111 11111111 11111111 11110110

//11111111 11111111 11111111 11110110
//11111111 11111111 11111111 11110101 -1
//10000000 00000000 00000000 00001010 取反

//11111111 11111111 11111111 11110110 补码
//10000000 00000000 00000000 00001001 取反
//10000000 00000000 00000000 00001010 +1

//原码 取反 加1 得到补码
//补码 减1 取反 得到原码
//补码 取反 加1 得到原码

//补码和原码的运算过程相同， 不需要额外的硬件

//int main()
//{
//	int a = 0x11223344;
//	return 0;
//}

//百度2015年系统工程师笔试题
//请简述大端字节序和小端字节序的概念， 设计一个小程序来判断当前机器的字节序

//int main()
//{
//	int a = 1;
//	//取出a的第一个字节的内容
//	char* p = (char*)&a;
//	if (*p == 1)
//		printf("小端字节序\n");
//	else
//		printf("大端字节序\n");
//	return 0;
//}

//int check_sys(void)
//{
//	int a = 1;
//	char* p = (char*)&a;
//	return *p;//返回1表示小端，返回0表示大端
//}
//int main()
//{
//	int ret = check_sys();
//	if (1 == ret)
//		printf("小端字节序\n");
//	else
//		printf("大端字节序\n");
//	return 0;
//}


//int main()
//{
//	char a = -1;
//	//10000000 00000000 00000000 00000001
//	//11111111 11111111 11111111 11111110
//	//11111111 11111111 11111111 11111111 补码
//	//11111111
//	signed char b = -1;
//	//11111111
//	unsigned char c = -1;
//	//11111111
//	printf("a=%d b=%d c=%d\n", a, b, c);
//	//%d 以整数的形式打印， 发生了整形提升
//	//a - 11111111 11111111 11111111 11111111 -1
//	//b - 11111111 11111111 11111111 11111111
//	//c - 00000000 00000000 00000000 11111111 255
//	return 0;
//}
//有符号位整形提升，高位补1
//无符号位整形提升，高位补0

//补充：
//1.char 到低是 signed char 还是 unsigned char ？
//C语言标准并未规定，取决于编译器
//但是 int 是 signed int，short 是 signed short

//int main()
//{
//	char a = -128;
//	//10000000 00000000 00000000 10000000
//	//11111111 11111111 11111111 01111111
//	//11111111 11111111 11111111 10000000
//	//10000000
//	printf("%d\n", a);//-128
//	//11111111 11111111 11111111 10000000
//	//10000000 00000000 00000000 01111111
//	//10000000 00000000 00000000 10000000
//	//4294967168 %u 无符号的整形，以%u的视角来看，内存里的补码是无符号的，是正数
//	// 正数原反补相同
//	
//	return 0;
//}

int main()
{
	char a = 128;
	//00000000 00000000 00000000 1000000
	//10000001
	printf("%u\n", a);
	//11111111111111111111111110000000 
	//4294967168
	return 0;
}

