#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	int i = -20;
//	//10000000 00000000 00000000 00010100
//	//11111111 11111111 11111111 11101011 补码
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010
//	printf("%d\n", i + j);//%d 十进制的有符号数
//	//11111111 11111111 11111111 11101011
//	//00000000 00000000 00000000 00001010
//	//11111111 11111111 11111111 11110101 补码
//	//10000000 00000000 00000000 00001010 
//	//-10
//	return 0;
//}

//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}

//#include<string.h>
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;//-1 -2 -3 ... -128 127 126 ... 3 2 1 0
//	}
//	printf("%d", strlen(a));//128+127=255
//	return 0;
//}//-1-127 -1+128 -1+127

//浮点数的存储（放进去）
//int main()
//{
//	float f = 5.5f;
//	//101.1
//	//(-1)^0*1.011*2^2
//	//s=0, M=1.011, E=2+127
//	//01000000 10110000 00000000 00000000
//	//40 b0 00 00
//	//00 00 b0 40
//	return 0;
//}

int main()
{
	int n = 9;
	//00000000 00000000 00000000 00001001
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);//9
	printf("*pFloat的值为：%f\n", *pFloat);//0.000000

	*pFloat = 9.0;
	printf("num的值为： %d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);
	return 0;
}
